Here's the output of `terraform plan -no-color -var github_token=...` (note that I haven't yet imported any existing state -- need to do that):

```
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.


------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.cms_program_oeda_dasg.github_repository.repos["cms-oeda-dasg"] will be created
  + resource "github_repository" "repos" {
      + allow_merge_commit     = true
      + allow_rebase_merge     = true
      + allow_squash_merge     = true
      + archived               = false
      + default_branch         = (known after apply)
      + delete_branch_on_merge = false
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + name                   = "cms-oeda-dasg"
      + node_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
    }

  # module.cms_program_oeda_dasg.github_team.admins will be created
  + resource "github_team" "admins" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + name    = "oeda-dasg-admins"
      + node_id = (known after apply)
      + privacy = "secret"
      + slug    = (known after apply)
    }

  # module.cms_program_oeda_dasg.github_team.partners will be created
  + resource "github_team" "partners" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + name    = "oeda-dasg-partners"
      + node_id = (known after apply)
      + privacy = "secret"
      + slug    = (known after apply)
    }

  # module.cms_program_oeda_dasg.github_team.staff will be created
  + resource "github_team" "staff" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + name    = "oeda-dasg-staff"
      + node_id = (known after apply)
      + privacy = "secret"
      + slug    = (known after apply)
    }

  # module.cms_program_oeda_dasg.github_team_membership.admins_maintainers["karlmdavis"] will be created
  + resource "github_team_membership" "admins_maintainers" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "maintainer"
      + team_id  = (known after apply)
      + username = "karlmdavis"
    }

  # module.cms_program_oeda_dasg.github_team_membership.partners_maintainers["karlmdavis"] will be created
  + resource "github_team_membership" "partners_maintainers" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "maintainer"
      + team_id  = (known after apply)
      + username = "karlmdavis"
    }

  # module.cms_program_oeda_dasg.github_team_membership.staff_maintainers["karlmdavis"] will be created
  + resource "github_team_membership" "staff_maintainers" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "maintainer"
      + team_id  = (known after apply)
      + username = "karlmdavis"
    }

  # module.cms_program_oeda_dasg.github_team_membership.staff_members["RickHawesUSDS"] will be created
  + resource "github_team_membership" "staff_members" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = (known after apply)
      + username = "RickHawesUSDS"
    }

  # module.cms_program_oeda_dasg.github_team_repository.repos_admins["cms-oeda-dasg"] will be created
  + resource "github_team_repository" "repos_admins" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "admin"
      + repository = "cms-oeda-dasg"
      + team_id    = (known after apply)
    }

  # module.cms_program_oeda_dasg.github_team_repository.repos_partners["cms-oeda-dasg"] will be created
  + resource "github_team_repository" "repos_partners" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "cms-oeda-dasg"
      + team_id    = (known after apply)
    }

  # module.cms_program_oeda_dasg.github_team_repository.repos_staff["cms-oeda-dasg"] will be created
  + resource "github_team_repository" "repos_staff" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "maintain"
      + repository = "cms-oeda-dasg"
      + team_id    = (known after apply)
    }

Plan: 11 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.
```